Revit 2026 API

# FilterCategoryRule Constructor

---

Initializes a new instance of the FilterCategoryRule class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilterCategoryRule(
	ICollection<ElementId> categories
)
```
```vb
Public Sub New (
	categories As ICollection(Of ElementId)
)
```
```cpp
public:
FilterCategoryRule(
	ICollection<ElementId^>^ categories
)
```
```fsharp
new :
        categories : ICollection<ElementId> -> FilterCategoryRule
```

#### Parameters

categories ICollectionElementId

#### Reference

FilterCategoryRule Class

Autodesk.Revit.DB Namespace